Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/include/proc/p32mz1025das176.h
extern volatile __DDRCMD113bits_t DDRCMD113bits __asm__ ("DDRCMD113") __attribute__((section("sfrs"), address(0xBF8E80B4)));
#define DDRCMD114 DDRCMD114
extern volatile uint32_t   DDRCMD114 __attribute__((section("sfrs"), address(0xBF8E80B8)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD114bits_t;
extern volatile __DDRCMD114bits_t DDRCMD114bits __asm__ ("DDRCMD114") __attribute__((section("sfrs"), address(0xBF8E80B8)));
#define DDRCMD115 DDRCMD115
extern volatile uint32_t   DDRCMD115 __attribute__((section("sfrs"), address(0xBF8E80BC)));
typedef struct {
  uint32_t CLKENCMD1:1;
  uint32_t CSCMD1:8;
  uint32_t RASCMD1:1;
  uint32_t CASCMD1:1;
  uint32_t WENCMD1:1;
  uint32_t CLKENCMD2:1;
  uint32_t CSCMD2:8;
  uint32_t RASCMD2:1;
  uint32_t CASCMD2:1;
  uint32_t WENCMD2:1;
  uint32_t MDALCMD:8;
} __DDRCMD115bits_t;
extern volatile __DDRCMD115bits_t DDRCMD115bits __asm__ ("DDRCMD115") __attribute__((section("sfrs"), address(0xBF8E80BC)));
#define DDRCMD20 DDRCMD20
extern volatile uint32_t   DDRCMD20 __attribute__((section("sfrs"), address(0xBF8E80C0)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD20bits_t;
extern volatile __DDRCMD20bits_t DDRCMD20bits __asm__ ("DDRCMD20") __attribute__((section("sfrs"), address(0xBF8E80C0)));
#define DDRCMD21 DDRCMD21
extern volatile uint32_t   DDRCMD21 __attribute__((section("sfrs"), address(0xBF8E80C4)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD21bits_t;
extern volatile __DDRCMD21bits_t DDRCMD21bits __asm__ ("DDRCMD21") __attribute__((section("sfrs"), address(0xBF8E80C4)));
#define DDRCMD22 DDRCMD22
extern volatile uint32_t   DDRCMD22 __attribute__((section("sfrs"), address(0xBF8E80C8)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD22bits_t;
extern volatile __DDRCMD22bits_t DDRCMD22bits __asm__ ("DDRCMD22") __attribute__((section("sfrs"), address(0xBF8E80C8)));
#define DDRCMD23 DDRCMD23
extern volatile uint32_t   DDRCMD23 __attribute__((section("sfrs"), address(0xBF8E80CC)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD23bits_t;
extern volatile __DDRCMD23bits_t DDRCMD23bits __asm__ ("DDRCMD23") __attribute__((section("sfrs"), address(0xBF8E80CC)));
#define DDRCMD24 DDRCMD24
extern volatile uint32_t   DDRCMD24 __attribute__((section("sfrs"), address(0xBF8E80D0)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD24bits_t;
extern volatile __DDRCMD24bits_t DDRCMD24bits __asm__ ("DDRCMD24") __attribute__((section("sfrs"), address(0xBF8E80D0)));
#define DDRCMD25 DDRCMD25
extern volatile uint32_t   DDRCMD25 __attribute__((section("sfrs"), address(0xBF8E80D4)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD25bits_t;
extern volatile __DDRCMD25bits_t DDRCMD25bits __asm__ ("DDRCMD25") __attribute__((section("sfrs"), address(0xBF8E80D4)));
#define DDRCMD26 DDRCMD26
extern volatile uint32_t   DDRCMD26 __attribute__((section("sfrs"), address(0xBF8E80D8)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD26bits_t;
extern volatile __DDRCMD26bits_t DDRCMD26bits __asm__ ("DDRCMD26") __attribute__((section("sfrs"), address(0xBF8E80D8)));
#define DDRCMD27 DDRCMD27
extern volatile uint32_t   DDRCMD27 __attribute__((section("sfrs"), address(0xBF8E80DC)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD27bits_t;
extern volatile __DDRCMD27bits_t DDRCMD27bits __asm__ ("DDRCMD27") __attribute__((section("sfrs"), address(0xBF8E80DC)));
#define DDRCMD28 DDRCMD28
extern volatile uint32_t   DDRCMD28 __attribute__((section("sfrs"), address(0xBF8E80E0)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD28bits_t;
extern volatile __DDRCMD28bits_t DDRCMD28bits __asm__ ("DDRCMD28") __attribute__((section("sfrs"), address(0xBF8E80E0)));
#define DDRCMD29 DDRCMD29
extern volatile uint32_t   DDRCMD29 __attribute__((section("sfrs"), address(0xBF8E80E4)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD29bits_t;
extern volatile __DDRCMD29bits_t DDRCMD29bits __asm__ ("DDRCMD29") __attribute__((section("sfrs"), address(0xBF8E80E4)));
#define DDRCMD210 DDRCMD210
extern volatile uint32_t   DDRCMD210 __attribute__((section("sfrs"), address(0xBF8E80E8)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD210bits_t;
extern volatile __DDRCMD210bits_t DDRCMD210bits __asm__ ("DDRCMD210") __attribute__((section("sfrs"), address(0xBF8E80E8)));
#define DDRCMD211 DDRCMD211
extern volatile uint32_t   DDRCMD211 __attribute__((section("sfrs"), address(0xBF8E80EC)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD211bits_t;
extern volatile __DDRCMD211bits_t DDRCMD211bits __asm__ ("DDRCMD211") __attribute__((section("sfrs"), address(0xBF8E80EC)));
#define DDRCMD212 DDRCMD212
extern volatile uint32_t   DDRCMD212 __attribute__((section("sfrs"), address(0xBF8E80F0)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD212bits_t;
extern volatile __DDRCMD212bits_t DDRCMD212bits __asm__ ("DDRCMD212") __attribute__((section("sfrs"), address(0xBF8E80F0)));
#define DDRCMD213 DDRCMD213
extern volatile uint32_t   DDRCMD213 __attribute__((section("sfrs"), address(0xBF8E80F4)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD213bits_t;
extern volatile __DDRCMD213bits_t DDRCMD213bits __asm__ ("DDRCMD213") __attribute__((section("sfrs"), address(0xBF8E80F4)));
#define DDRCMD214 DDRCMD214
extern volatile uint32_t   DDRCMD214 __attribute__((section("sfrs"), address(0xBF8E80F8)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD214bits_t;
extern volatile __DDRCMD214bits_t DDRCMD214bits __asm__ ("DDRCMD214") __attribute__((section("sfrs"), address(0xBF8E80F8)));
#define DDRCMD215 DDRCMD215
extern volatile uint32_t   DDRCMD215 __attribute__((section("sfrs"), address(0xBF8E80FC)));
typedef struct {
  uint32_t MDADDRHCMD:8;
  uint32_t BNKADDRCMD:3;
  uint32_t WAIT:9;
} __DDRCMD215bits_t;
extern volatile __DDRCMD215bits_t DDRCMD215bits __asm__ ("DDRCMD215") __attribute__((section("sfrs"), address(0xBF8E80FC)));
#define DDRSCLSTART DDRSCLSTART
extern volatile uint32_t   DDRSCLSTART __attribute__((section("sfrs"), address(0xBF8E9100)));
typedef struct {
  uint32_t SCLLBPASS:1;
  uint32_t SCLUBPASS:1;
  uint32_t :24;
  uint32_t SCLEN:1;
  uint32_t :1;
  uint32_t SCLSTART:1;
  uint32_t SCLPHCAL:1;
} __DDRSCLSTARTbits_t;
extern volatile __DDRSCLSTARTbits_t DDRSCLSTARTbits __asm__ ("DDRSCLSTART") __attribute__((section("sfrs"), address(0xBF8E9100)));
#define DDRSCLLAT DDRSCLLAT
extern volatile uint32_t   DDRSCLLAT __attribute__((section("sfrs"), address(0xBF8E910C)));
typedef struct {
  uint32_t CAPCLKDLY:4;
  uint32_t DDRCLKDLY:4;
} __DDRSCLLATbits_t;
