Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/include/proc/p32mz1025das176.h
#define _OC7CON_ON_POSITION                      0x0000000F
#define _OC7CON_ON_MASK                          0x00008000
#define _OC7CON_ON_LENGTH                        0x00000001

#define _OC7CON_OCM0_POSITION                    0x00000000
#define _OC7CON_OCM0_MASK                        0x00000001
#define _OC7CON_OCM0_LENGTH                      0x00000001

#define _OC7CON_OCM1_POSITION                    0x00000001
#define _OC7CON_OCM1_MASK                        0x00000002
#define _OC7CON_OCM1_LENGTH                      0x00000001

#define _OC7CON_OCM2_POSITION                    0x00000002
#define _OC7CON_OCM2_MASK                        0x00000004
#define _OC7CON_OCM2_LENGTH                      0x00000001

#define _OC7CON_OCSIDL_POSITION                  0x0000000D
#define _OC7CON_OCSIDL_MASK                      0x00002000
#define _OC7CON_OCSIDL_LENGTH                    0x00000001

#define _OC7CON_w_POSITION                       0x00000000
#define _OC7CON_w_MASK                           0xFFFFFFFF
#define _OC7CON_w_LENGTH                         0x00000020

#define _OC8CON_OCM_POSITION                     0x00000000
#define _OC8CON_OCM_MASK                         0x00000007
#define _OC8CON_OCM_LENGTH                       0x00000003

#define _OC8CON_OCTSEL_POSITION                  0x00000003
#define _OC8CON_OCTSEL_MASK                      0x00000008
#define _OC8CON_OCTSEL_LENGTH                    0x00000001

#define _OC8CON_OCFLT_POSITION                   0x00000004
#define _OC8CON_OCFLT_MASK                       0x00000010
#define _OC8CON_OCFLT_LENGTH                     0x00000001

#define _OC8CON_OC32_POSITION                    0x00000005
#define _OC8CON_OC32_MASK                        0x00000020
#define _OC8CON_OC32_LENGTH                      0x00000001

#define _OC8CON_SIDL_POSITION                    0x0000000D
#define _OC8CON_SIDL_MASK                        0x00002000
#define _OC8CON_SIDL_LENGTH                      0x00000001

#define _OC8CON_ON_POSITION                      0x0000000F
#define _OC8CON_ON_MASK                          0x00008000
#define _OC8CON_ON_LENGTH                        0x00000001

#define _OC8CON_OCM0_POSITION                    0x00000000
#define _OC8CON_OCM0_MASK                        0x00000001
#define _OC8CON_OCM0_LENGTH                      0x00000001

#define _OC8CON_OCM1_POSITION                    0x00000001
#define _OC8CON_OCM1_MASK                        0x00000002
#define _OC8CON_OCM1_LENGTH                      0x00000001

#define _OC8CON_OCM2_POSITION                    0x00000002
#define _OC8CON_OCM2_MASK                        0x00000004
#define _OC8CON_OCM2_LENGTH                      0x00000001

#define _OC8CON_OCSIDL_POSITION                  0x0000000D
#define _OC8CON_OCSIDL_MASK                      0x00002000
#define _OC8CON_OCSIDL_LENGTH                    0x00000001

#define _OC8CON_w_POSITION                       0x00000000
#define _OC8CON_w_MASK                           0xFFFFFFFF
#define _OC8CON_w_LENGTH                         0x00000020

#define _OC9CON_OCM_POSITION                     0x00000000
#define _OC9CON_OCM_MASK                         0x00000007
#define _OC9CON_OCM_LENGTH                       0x00000003

#define _OC9CON_OCTSEL_POSITION                  0x00000003
#define _OC9CON_OCTSEL_MASK                      0x00000008
#define _OC9CON_OCTSEL_LENGTH                    0x00000001

#define _OC9CON_OCFLT_POSITION                   0x00000004
#define _OC9CON_OCFLT_MASK                       0x00000010
#define _OC9CON_OCFLT_LENGTH                     0x00000001

#define _OC9CON_OC32_POSITION                    0x00000005
#define _OC9CON_OC32_MASK                        0x00000020
#define _OC9CON_OC32_LENGTH                      0x00000001

#define _OC9CON_SIDL_POSITION                    0x0000000D
#define _OC9CON_SIDL_MASK                        0x00002000
#define _OC9CON_SIDL_LENGTH                      0x00000001

#define _OC9CON_ON_POSITION                      0x0000000F
#define _OC9CON_ON_MASK                          0x00008000
#define _OC9CON_ON_LENGTH                        0x00000001

#define _OC9CON_OCM0_POSITION                    0x00000000
#define _OC9CON_OCM0_MASK                        0x00000001
#define _OC9CON_OCM0_LENGTH                      0x00000001

#define _OC9CON_OCM1_POSITION                    0x00000001
#define _OC9CON_OCM1_MASK                        0x00000002
#define _OC9CON_OCM1_LENGTH                      0x00000001

#define _OC9CON_OCM2_POSITION                    0x00000002
#define _OC9CON_OCM2_MASK                        0x00000004
#define _OC9CON_OCM2_LENGTH                      0x00000001

#define _OC9CON_OCSIDL_POSITION                  0x0000000D
#define _OC9CON_OCSIDL_MASK                      0x00002000
#define _OC9CON_OCSIDL_LENGTH                    0x00000001

#define _OC9CON_w_POSITION                       0x00000000
#define _OC9CON_w_MASK                           0xFFFFFFFF
#define _OC9CON_w_LENGTH                         0x00000020

#define _ADCCON1_STRGLVL_POSITION                0x00000003
#define _ADCCON1_STRGLVL_MASK                    0x00000008
#define _ADCCON1_STRGLVL_LENGTH                  0x00000001

#define _ADCCON1_IRQVS_POSITION                  0x00000004
#define _ADCCON1_IRQVS_MASK                      0x00000070
#define _ADCCON1_IRQVS_LENGTH                    0x00000003

#define _ADCCON1_FSPBCLKEN_POSITION              0x00000009
#define _ADCCON1_FSPBCLKEN_MASK                  0x00000200
#define _ADCCON1_FSPBCLKEN_LENGTH                0x00000001

#define _ADCCON1_FSSCLKEN_POSITION               0x0000000A
#define _ADCCON1_FSSCLKEN_MASK                   0x00000400
#define _ADCCON1_FSSCLKEN_LENGTH                 0x00000001

#define _ADCCON1_CVDEN_POSITION                  0x0000000B
#define _ADCCON1_CVDEN_MASK                      0x00000800
#define _ADCCON1_CVDEN_LENGTH                    0x00000001

#define _ADCCON1_AICPMPEN_POSITION               0x0000000C
#define _ADCCON1_AICPMPEN_MASK                   0x00001000
#define _ADCCON1_AICPMPEN_LENGTH                 0x00000001

